[Killed] PublicVisibility
:6:5
 
 class Utils
 {
-    public static function calculatePagination(int $currentPage, int $itemsPerPage = 8): array
+    protected static function calculatePagination(int $currentPage, int $itemsPerPage = 8): array
     {
         if ($itemsPerPage <= 0) {
killedBy: DataPendudukPaginationTest::utils_calculate_pagination_page_one
statusReason: 1) DataPendudukPaginationTest::utils_calculate_pagination_page_one
Error: Call to protected method Utils::calculatePagination() from scope DataPendudukPaginationTest

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:323

ERRORS!
Tests: 27, Assertions: 60, Errors: 1.

[Survived] IncrementInteger
:6:5
 
 class Utils
 {
-    public static function calculatePagination(int $currentPage, int $itemsPerPage = 8): array
+    public static function calculatePagination(int $currentPage, int $itemsPerPage = 9): array
     {
         if ($itemsPerPage <= 0) {

[Killed] LessThanOrEqualToNegotiation
:8:9
 {
     public static function calculatePagination(int $currentPage, int $itemsPerPage = 8): array
     {
-        if ($itemsPerPage <= 0) {
+        if ($itemsPerPage > 0) {
             $itemsPerPage = 8;
         }
killedBy: DataPendudukPaginationTest::utils_calculate_pagination_various_items_per_page
statusReason: 1) DataPendudukPaginationTest::utils_calculate_pagination_various_items_per_page
Failed asserting that 16 is identical to 20.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:357

FAILURES!
Tests: 30, Assertions: 71, Failures: 1.

[Survived] LessThanOrEqualTo
:8:9
 {
     public static function calculatePagination(int $currentPage, int $itemsPerPage = 8): array
     {
-        if ($itemsPerPage <= 0) {
+        if ($itemsPerPage < 0) {
             $itemsPerPage = 8;
         }

[Killed] LessThanOrEqualToNegotiation
:12:9
             $itemsPerPage = 8;
         }
 
-        if ($currentPage <= 0) {
+        if ($currentPage > 0) {
             $page = 1;
         } else {
killedBy: DataPendudukPaginationTest::utils_calculate_pagination_page_two
statusReason: 1) DataPendudukPaginationTest::utils_calculate_pagination_page_two
Failed asserting that 1 is identical to 2.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:337

FAILURES!
Tests: 28, Assertions: 66, Failures: 1.

[Killed] LessThanOrEqualTo
:12:9
             $itemsPerPage = 8;
         }
 
-        if ($currentPage <= 0) {
+        if ($currentPage < 0) {
             $page = 1;
         } else {
killedBy: DataPendudukPaginationTest::utils_calculate_pagination_negative_defaults_to_one
statusReason: 1) DataPendudukPaginationTest::utils_calculate_pagination_negative_defaults_to_one
Failed asserting that 0 is identical to 1.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:346

FAILURES!
Tests: 29, Assertions: 68, Failures: 1.

[Killed] IncrementInteger
:13:13
         }
 
         if ($currentPage <= 0) {
-            $page = 1;
+            $page = 2;
         } else {
             $page = $currentPage;
killedBy: DataPendudukPaginationTest::utils_calculate_pagination_negative_defaults_to_one
statusReason: 1) DataPendudukPaginationTest::utils_calculate_pagination_negative_defaults_to_one
Failed asserting that 2 is identical to 1.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:346

FAILURES!
Tests: 29, Assertions: 68, Failures: 1.

[Killed] IncrementInteger
:18:9
             $page = $currentPage;
         }
 
-        $position = ($page - 1) * $itemsPerPage;
+        $position = ($page - 2) * $itemsPerPage;
 
         return [
killedBy: DataPendudukPaginationTest::utils_calculate_pagination_page_one
statusReason: 1) DataPendudukPaginationTest::utils_calculate_pagination_page_one
Failed asserting that -8 is identical to 0.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:329

FAILURES!
Tests: 27, Assertions: 65, Failures: 1.

[Killed] Multiplication
:18:9
             $page = $currentPage;
         }
 
-        $position = ($page - 1) * $itemsPerPage;
+        $position = ($page - 1) / $itemsPerPage;
 
         return [
killedBy: DataPendudukPaginationTest::utils_calculate_pagination_page_two
statusReason: 1) DataPendudukPaginationTest::utils_calculate_pagination_page_two
Failed asserting that 0.125 is identical to 8.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:338

FAILURES!
Tests: 28, Assertions: 67, Failures: 1.

[Killed] ArrayItemRemoval
:20:9
 
         $position = ($page - 1) * $itemsPerPage;
 
-        return [
-            'page' => $page,
-            'position' => $position,
-            'itemsPerPage' => $itemsPerPage
-        ];
+        return ['position' => $position, 'itemsPerPage' => $itemsPerPage];
     }
 
killedBy: DataPendudukPaginationTest::utils_calculate_pagination_page_one
statusReason: 1) DataPendudukPaginationTest::utils_calculate_pagination_page_one
Failed asserting that an array has the key 'page'.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:326

FAILURES!
Tests: 27, Assertions: 62, Failures: 1.

[Killed] PublicVisibility
:27:5
         ];
     }
 
-    public static function buildPaginationUrl(int $page): string
+    protected static function buildPaginationUrl(int $page): string
     {
         if ($page <= 0) {
killedBy: DataPendudukPaginationTest::utils_build_pagination_url_page_one
statusReason: 1) DataPendudukPaginationTest::utils_build_pagination_url_page_one
Error: Call to protected method Utils::buildPaginationUrl() from scope DataPendudukPaginationTest

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:364

ERRORS!
Tests: 31, Assertions: 72, Errors: 1.

[Killed] LessThanOrEqualTo
:29:9
 
     public static function buildPaginationUrl(int $page): string
     {
-        if ($page <= 0) {
+        if ($page < 0) {
             $page = 1;
         }
killedBy: DataPendudukPaginationTest::utils_build_pagination_url_zero_defaults_to_one
statusReason: 1) DataPendudukPaginationTest::utils_build_pagination_url_zero_defaults_to_one
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?id=1'
+'?id=0'

[Killed] LessThanOrEqualToNegotiation
:29:9
 
     public static function buildPaginationUrl(int $page): string
     {
-        if ($page <= 0) {
+        if ($page > 0) {
             $page = 1;
         }
killedBy: DataPendudukPaginationTest::utils_build_pagination_url_page_three
statusReason: 1) DataPendudukPaginationTest::utils_build_pagination_url_page_three
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?id=3'
+'?id=1'

[Killed] IncrementInteger
:30:13
     public static function buildPaginationUrl(int $page): string
     {
         if ($page <= 0) {
-            $page = 1;
+            $page = 2;
         }
         return '?id=' . $page;
killedBy: DataPendudukPaginationTest::utils_build_pagination_url_zero_defaults_to_one
statusReason: 1) DataPendudukPaginationTest::utils_build_pagination_url_zero_defaults_to_one
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?id=1'
+'?id=2'

[Killed] ConcatOperandRemoval
:32:9
         if ($page <= 0) {
             $page = 1;
         }
-        return '?id=' . $page;
+        return '?id=';
     }
 
killedBy: DataPendudukPaginationTest::utils_build_pagination_url_page_one
statusReason: 1) DataPendudukPaginationTest::utils_build_pagination_url_page_one
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?id=1'
+'?id='

[Killed] Concat
:32:9
         if ($page <= 0) {
             $page = 1;
         }
-        return '?id=' . $page;
+        return $page . '?id=';
     }
 
killedBy: DataPendudukPaginationTest::utils_build_pagination_url_page_one
statusReason: 1) DataPendudukPaginationTest::utils_build_pagination_url_page_one
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?id=1'
+'1?id='

[Killed] PublicVisibility
:35:5
         return '?id=' . $page;
     }
 
-    public static function isFirstPage(int $page): bool
+    protected static function isFirstPage(int $page): bool
     {
         return $page <= 1;
killedBy: DataPendudukPaginationTest::utils_is_first_page_true
statusReason: 1) DataPendudukPaginationTest::utils_is_first_page_true
Error: Call to protected method Utils::isFirstPage() from scope DataPendudukPaginationTest

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:392

ERRORS!
Tests: 34, Assertions: 79, Errors: 1.

[Killed] LessThanOrEqualToNegotiation
:37:9
 
     public static function isFirstPage(int $page): bool
     {
-        return $page <= 1;
+        return $page > 1;
     }
 
killedBy: DataPendudukPaginationTest::utils_is_first_page_true
statusReason: 1) DataPendudukPaginationTest::utils_is_first_page_true
Failed asserting that false is true.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:394

FAILURES!
Tests: 34, Assertions: 80, Failures: 1.

[Killed] LessThanOrEqualTo
:37:9
 
     public static function isFirstPage(int $page): bool
     {
-        return $page <= 1;
+        return $page < 1;
     }
 
killedBy: DataPendudukPaginationTest::utils_is_first_page_true
statusReason: 1) DataPendudukPaginationTest::utils_is_first_page_true
Failed asserting that false is true.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:394

FAILURES!
Tests: 34, Assertions: 80, Failures: 1.

[Killed] PublicVisibility
:40:5
         return $page <= 1;
     }
 
-    public static function hasNextPage(int $page, int $totalPages): bool
+    protected static function hasNextPage(int $page, int $totalPages): bool
     {
         return $page < $totalPages;
killedBy: DataPendudukPaginationTest::utils_has_next_page_true
statusReason: 1) DataPendudukPaginationTest::utils_has_next_page_true
Error: Call to protected method Utils::hasNextPage() from scope DataPendudukPaginationTest

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:418

ERRORS!
Tests: 37, Assertions: 84, Errors: 1.

[Killed] LessThan
:42:9
 
     public static function hasNextPage(int $page, int $totalPages): bool
     {
-        return $page < $totalPages;
+        return $page <= $totalPages;
     }
 
killedBy: DataPendudukPaginationTest::utils_has_next_page_false_at_last
statusReason: 1) DataPendudukPaginationTest::utils_has_next_page_false_at_last
Failed asserting that true is false.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:429

FAILURES!
Tests: 38, Assertions: 87, Failures: 1.

[Killed] LessThanNegotiation
:42:9
 
     public static function hasNextPage(int $page, int $totalPages): bool
     {
-        return $page < $totalPages;
+        return $page >= $totalPages;
     }
 
killedBy: DataPendudukPaginationTest::utils_has_next_page_true
statusReason: 1) DataPendudukPaginationTest::utils_has_next_page_true
Failed asserting that false is true.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:420

FAILURES!
Tests: 37, Assertions: 85, Failures: 1.

[Killed] PublicVisibility
:45:5
         return $page < $totalPages;
     }
 
-    public static function calculateTotalPages(int $totalItems, int $itemsPerPage = 8): int
+    protected static function calculateTotalPages(int $totalItems, int $itemsPerPage = 8): int
     {
         if ($totalItems === 0) {
killedBy: DataPendudukPaginationTest::utils_calculate_total_pages
statusReason: 1) DataPendudukPaginationTest::utils_calculate_total_pages
Error: Call to protected method Utils::calculateTotalPages() from scope DataPendudukPaginationTest

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:510

ERRORS!
Tests: 44, Assertions: 116, Errors: 1.

[Survived] IncrementInteger
:45:5
         return $page < $totalPages;
     }
 
-    public static function calculateTotalPages(int $totalItems, int $itemsPerPage = 8): int
+    public static function calculateTotalPages(int $totalItems, int $itemsPerPage = 9): int
     {
         if ($totalItems === 0) {

[Killed] Identical
:47:9
 
     public static function calculateTotalPages(int $totalItems, int $itemsPerPage = 8): int
     {
-        if ($totalItems === 0) {
+        if ($totalItems !== 0) {
             return 0;
         }
killedBy: DataPendudukPaginationTest::utils_calculate_total_pages
statusReason: 1) DataPendudukPaginationTest::utils_calculate_total_pages
Failed asserting that 0 is identical to 4.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:513

FAILURES!
Tests: 44, Assertions: 118, Failures: 1.

[Survived] DecrementInteger
:47:9
 
     public static function calculateTotalPages(int $totalItems, int $itemsPerPage = 8): int
     {
-        if ($totalItems === 0) {
+        if ($totalItems === -1) {
             return 0;
         }

[Killed] IncrementInteger
:48:13
     public static function calculateTotalPages(int $totalItems, int $itemsPerPage = 8): int
     {
         if ($totalItems === 0) {
-            return 0;
+            return 1;
         }
 
killedBy: DataPendudukPaginationTest::utils_calculate_total_pages_edge_cases
statusReason: 1) DataPendudukPaginationTest::utils_calculate_total_pages_edge_cases
Failed asserting that 1 is identical to 0.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:520

FAILURES!
Tests: 45, Assertions: 119, Failures: 1.

[Killed] DecrementInteger
:48:13
     public static function calculateTotalPages(int $totalItems, int $itemsPerPage = 8): int
     {
         if ($totalItems === 0) {
-            return 0;
+            return -1;
         }
 
killedBy: DataPendudukPaginationTest::utils_calculate_total_pages_edge_cases
statusReason: 1) DataPendudukPaginationTest::utils_calculate_total_pages_edge_cases
Failed asserting that -1 is identical to 0.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:520

FAILURES!
Tests: 45, Assertions: 119, Failures: 1.

[Killed] Identical
:51:9
             return 0;
         }
 
-        if ($itemsPerPage === 0) {
+        if ($itemsPerPage !== 0) {
             return 1;
         }
killedBy: DataPendudukPaginationTest::utils_calculate_total_pages
statusReason: 1) DataPendudukPaginationTest::utils_calculate_total_pages
Failed asserting that 1 is identical to 4.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:513

FAILURES!
Tests: 44, Assertions: 118, Failures: 1.

[Survived] DecrementInteger
:51:9
             return 0;
         }
 
-        if ($itemsPerPage === 0) {
+        if ($itemsPerPage === -1) {
             return 1;
         }

[Killed] Division
:55:9
             return 1;
         }
 
-        return (int)ceil($totalItems / $itemsPerPage);
+        return (int) ceil($totalItems * $itemsPerPage);
     }
 }
killedBy: DataPendudukPaginationTest::utils_calculate_total_pages
statusReason: 1) DataPendudukPaginationTest::utils_calculate_total_pages
Failed asserting that 200 is identical to 4.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:513

FAILURES!
Tests: 44, Assertions: 118, Failures: 1.

[Killed] RoundingFamily
:55:9
             return 1;
         }
 
-        return (int)ceil($totalItems / $itemsPerPage);
+        return (int) round($totalItems / $itemsPerPage);
     }
 }
killedBy: DataPendudukPaginationTest::utils_calculate_total_pages
statusReason: 1) DataPendudukPaginationTest::utils_calculate_total_pages
Failed asserting that 3 is identical to 4.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\DataPendudukPaginationTest.php:513

FAILURES!
Tests: 44, Assertions: 118, Failures: 1.
