[Killed] PublicVisibility
:15:5
      * Generate a URL-safe slug from a title
      * Used in index.php (berita links) and datadesa.php (data desa links)
      */
-    public static function generateSlug(string $title): string
+    protected static function generateSlug(string $title): string
     {
         return strtolower(str_replace(' ', '-', $title));
killedBy: UtilsTest::generateSlug_converts_spaces_to_dashes
statusReason: 1) UtilsTest::generateSlug_converts_spaces_to_dashes
Error: Call to protected method Utils::generateSlug() from scope UtilsTest

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:14

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] UnwrapStrToLower
:17:9
      */
     public static function generateSlug(string $title): string
     {
-        return strtolower(str_replace(' ', '-', $title));
+        return str_replace(' ', '-', $title);
     }
 
killedBy: UtilsTest::generateSlug_converts_spaces_to_dashes
statusReason: 1) UtilsTest::generateSlug_converts_spaces_to_dashes
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'berita-terbaru-desa'
+'Berita-Terbaru-Desa'

[Killed] UnwrapStrReplace
:17:9
      */
     public static function generateSlug(string $title): string
     {
-        return strtolower(str_replace(' ', '-', $title));
+        return strtolower($title);
     }
 
killedBy: UtilsTest::generateSlug_converts_spaces_to_dashes
statusReason: 1) UtilsTest::generateSlug_converts_spaces_to_dashes
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'berita-terbaru-desa'
+'berita terbaru desa'

[Killed] PublicVisibility
:24:5
      * Calculate pagination details
      * Returns array with position and page number
      */
-    public static function calculatePagination(int $currentPage, int $itemsPerPage): array
+    protected static function calculatePagination(int $currentPage, int $itemsPerPage): array
     {
         if ($currentPage < 1) {
killedBy: UtilsTest::calculatePagination_first_page
statusReason: 1) UtilsTest::calculatePagination_first_page
Error: Call to protected method Utils::calculatePagination() from scope UtilsTest

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:61

ERRORS!
Tests: 5, Assertions: 15, Errors: 1.

[Killed] LessThanNegotiation
:26:9
      */
     public static function calculatePagination(int $currentPage, int $itemsPerPage): array
     {
-        if ($currentPage < 1) {
+        if ($currentPage >= 1) {
             $currentPage = 1;
         }
killedBy: UtilsTest::calculatePagination_third_page
statusReason: 1) UtilsTest::calculatePagination_third_page
Failed asserting that 1 is identical to 3.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:76

FAILURES!
Tests: 6, Assertions: 22, Failures: 1.

[Survived] LessThan
:26:9
      */
     public static function calculatePagination(int $currentPage, int $itemsPerPage): array
     {
-        if ($currentPage < 1) {
+        if ($currentPage <= 1) {
             $currentPage = 1;
         }

[Killed] IncrementInteger
:27:13
     public static function calculatePagination(int $currentPage, int $itemsPerPage): array
     {
         if ($currentPage < 1) {
-            $currentPage = 1;
+            $currentPage = 2;
         }
 
killedBy: UtilsTest::calculatePagination_negative_page_defaults_to_one
statusReason: 1) UtilsTest::calculatePagination_negative_page_defaults_to_one
Failed asserting that 2 is identical to 1.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:105

FAILURES!
Tests: 8, Assertions: 31, Failures: 1.

[Killed] DecrementInteger
:30:9
             $currentPage = 1;
         }
 
-        $position = ($currentPage - 1) * $itemsPerPage;
+        $position = ($currentPage - 0) * $itemsPerPage;
 
         return [
killedBy: UtilsTest::calculatePagination_first_page
statusReason: 1) UtilsTest::calculatePagination_first_page
Failed asserting that 10 is identical to 0.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:63

FAILURES!
Tests: 5, Assertions: 17, Failures: 1.

[Killed] Multiplication
:30:9
             $currentPage = 1;
         }
 
-        $position = ($currentPage - 1) * $itemsPerPage;
+        $position = ($currentPage - 1) / $itemsPerPage;
 
         return [
killedBy: UtilsTest::calculatePagination_third_page
statusReason: 1) UtilsTest::calculatePagination_third_page
Failed asserting that 0.25 is identical to 16.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:77

FAILURES!
Tests: 6, Assertions: 23, Failures: 1.

[Killed] PublicVisibility
:43:5
      * Format date for display (day month year)
      * Used in index.php for displaying article dates
      */
-    public static function formatDisplayDate(string $dateString): string
+    protected static function formatDisplayDate(string $dateString): string
     {
         return date('d F Y', strtotime($dateString));
killedBy: UtilsTest::formatDisplayDate_formats_correctly
statusReason: 1) UtilsTest::formatDisplayDate_formats_correctly
Error: Call to protected method Utils::formatDisplayDate() from scope UtilsTest

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:127

ERRORS!
Tests: 10, Assertions: 37, Errors: 1.

[Killed] PublicVisibility
:52:5
      * Extract day from date string
      * Used in index.php for pengumuman card display
      */
-    public static function extractDay(string $dateString): string
+    protected static function extractDay(string $dateString): string
     {
         return date('d', strtotime($dateString));
killedBy: UtilsTest::extractDay_returns_day_number
statusReason: 1) UtilsTest::extractDay_returns_day_number
Error: Call to protected method Utils::extractDay() from scope UtilsTest

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:163

ERRORS!
Tests: 13, Assertions: 48, Errors: 1.

[Killed] PublicVisibility
:61:5
      * Extract month from date string
      * Used in index.php for pengumuman card display
      */
-    public static function extractMonth(string $dateString): string
+    protected static function extractMonth(string $dateString): string
     {
         return date('F', strtotime($dateString));
killedBy: UtilsTest::extractMonth_returns_month_name
statusReason: 1) UtilsTest::extractMonth_returns_month_name
Error: Call to protected method Utils::extractMonth() from scope UtilsTest

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:199

ERRORS!
Tests: 16, Assertions: 60, Errors: 1.

[Killed] PublicVisibility
:69:5
     /**
      * Determine if current page is first page
      */
-    public static function isFirstPage(int $currentPage): bool
+    protected static function isFirstPage(int $currentPage): bool
     {
         return $currentPage <= 1;
killedBy: UtilsTest::isFirstPage_true_for_page_one
statusReason: 1) UtilsTest::isFirstPage_true_for_page_one
Error: Call to protected method Utils::isFirstPage() from scope UtilsTest

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:240

ERRORS!
Tests: 19, Assertions: 93, Errors: 1.

[Killed] LessThanOrEqualTo
:71:9
      */
     public static function isFirstPage(int $currentPage): bool
     {
-        return $currentPage <= 1;
+        return $currentPage < 1;
     }
 
killedBy: UtilsTest::isFirstPage_true_for_page_one
statusReason: 1) UtilsTest::isFirstPage_true_for_page_one
Failed asserting that false is true.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:241

FAILURES!
Tests: 19, Assertions: 94, Failures: 1.

[Killed] LessThanOrEqualToNegotiation
:71:9
      */
     public static function isFirstPage(int $currentPage): bool
     {
-        return $currentPage <= 1;
+        return $currentPage > 1;
     }
 
killedBy: UtilsTest::isFirstPage_true_for_page_one
statusReason: 1) UtilsTest::isFirstPage_true_for_page_one
Failed asserting that false is true.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:241

FAILURES!
Tests: 19, Assertions: 94, Failures: 1.

[Killed] PublicVisibility
:77:5
     /**
      * Check if page navigation should show next button
      */
-    public static function hasNextPage(int $currentPage, int $totalPages): bool
+    protected static function hasNextPage(int $currentPage, int $totalPages): bool
     {
         return $currentPage < $totalPages;
killedBy: UtilsTest::hasNextPage_true_when_current_less_than_total
statusReason: 1) UtilsTest::hasNextPage_true_when_current_less_than_total
Error: Call to protected method Utils::hasNextPage() from scope UtilsTest

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:283

ERRORS!
Tests: 23, Assertions: 105, Errors: 1.

[Killed] LessThan
:79:9
      */
     public static function hasNextPage(int $currentPage, int $totalPages): bool
     {
-        return $currentPage < $totalPages;
+        return $currentPage <= $totalPages;
     }
 
killedBy: UtilsTest::hasNextPage_false_when_on_last_page
statusReason: 1) UtilsTest::hasNextPage_false_when_on_last_page
Failed asserting that true is false.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:295

FAILURES!
Tests: 24, Assertions: 109, Failures: 1.

[Killed] LessThanNegotiation
:79:9
      */
     public static function hasNextPage(int $currentPage, int $totalPages): bool
     {
-        return $currentPage < $totalPages;
+        return $currentPage >= $totalPages;
     }
 
killedBy: UtilsTest::hasNextPage_true_when_current_less_than_total
statusReason: 1) UtilsTest::hasNextPage_true_when_current_less_than_total
Failed asserting that false is true.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:284

FAILURES!
Tests: 23, Assertions: 106, Failures: 1.

[Killed] PublicVisibility
:86:5
      * Build pagination URL parameter
      * Used in datadesa.php pagination
      */
-    public static function buildPaginationUrl(int $pageNumber): string
+    protected static function buildPaginationUrl(int $pageNumber): string
     {
         if ($pageNumber < 1) {
killedBy: UtilsTest::buildPaginationUrl_with_valid_page
statusReason: 1) UtilsTest::buildPaginationUrl_with_valid_page
Error: Call to protected method Utils::buildPaginationUrl() from scope UtilsTest

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:326

ERRORS!
Tests: 27, Assertions: 117, Errors: 1.

[Killed] LessThanNegotiation
:88:9
      */
     public static function buildPaginationUrl(int $pageNumber): string
     {
-        if ($pageNumber < 1) {
+        if ($pageNumber >= 1) {
             $pageNumber = 1;
         }
killedBy: UtilsTest::buildPaginationUrl_with_valid_page
statusReason: 1) UtilsTest::buildPaginationUrl_with_valid_page
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?id=3'
+'?id=1'

[Survived] LessThan
:88:9
      */
     public static function buildPaginationUrl(int $pageNumber): string
     {
-        if ($pageNumber < 1) {
+        if ($pageNumber <= 1) {
             $pageNumber = 1;
         }

[Killed] IncrementInteger
:89:13
     public static function buildPaginationUrl(int $pageNumber): string
     {
         if ($pageNumber < 1) {
-            $pageNumber = 1;
+            $pageNumber = 2;
         }
         return '?id=' . $pageNumber;
killedBy: UtilsTest::buildPaginationUrl_with_negative_page_defaults_to_one
statusReason: 1) UtilsTest::buildPaginationUrl_with_negative_page_defaults_to_one
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?id=1'
+'?id=2'

[Killed] ConcatOperandRemoval
:91:9
         if ($pageNumber < 1) {
             $pageNumber = 1;
         }
-        return '?id=' . $pageNumber;
+        return $pageNumber;
     }
 
killedBy: UtilsTest::buildPaginationUrl_with_valid_page
statusReason: 1) UtilsTest::buildPaginationUrl_with_valid_page
TypeError: Utils::buildPaginationUrl(): Return value must be of type string, int returned

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\lib\Utils.php:77
D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:326

ERRORS!
Tests: 27, Assertions: 117, Errors: 1.

[Killed] ConcatOperandRemoval
:91:9
         if ($pageNumber < 1) {
             $pageNumber = 1;
         }
-        return '?id=' . $pageNumber;
+        return '?id=';
     }
 
killedBy: UtilsTest::buildPaginationUrl_with_valid_page
statusReason: 1) UtilsTest::buildPaginationUrl_with_valid_page
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'?id=3'
+'?id='

[Killed] PublicVisibility
:97:5
     /**
      * Calculate total number of pages
      */
-    public static function calculateTotalPages(int $totalItems, int $itemsPerPage): int
+    protected static function calculateTotalPages(int $totalItems, int $itemsPerPage): int
     {
         if ($itemsPerPage <= 0) {
killedBy: UtilsTest::calculateTotalPages_single_page
statusReason: 1) UtilsTest::calculateTotalPages_single_page
Error: Call to protected method Utils::calculateTotalPages() from scope UtilsTest

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:376

ERRORS!
Tests: 31, Assertions: 132, Errors: 1.

[Killed] IntegerNegation
:100:13
     public static function calculateTotalPages(int $totalItems, int $itemsPerPage): int
     {
         if ($itemsPerPage <= 0) {
-            return 1;
+            return -1;
         }
         return (int)ceil($totalItems / $itemsPerPage);
killedBy: UtilsTest::calculateTotalPages_invalid_items_per_page
statusReason: 1) UtilsTest::calculateTotalPages_invalid_items_per_page
Failed asserting that -1 is identical to 1.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:420

FAILURES!
Tests: 35, Assertions: 145, Failures: 1.

[Killed] IncrementInteger
:100:13
     public static function calculateTotalPages(int $totalItems, int $itemsPerPage): int
     {
         if ($itemsPerPage <= 0) {
-            return 1;
+            return 2;
         }
         return (int)ceil($totalItems / $itemsPerPage);
killedBy: UtilsTest::calculateTotalPages_invalid_items_per_page
statusReason: 1) UtilsTest::calculateTotalPages_invalid_items_per_page
Failed asserting that 2 is identical to 1.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:420

FAILURES!
Tests: 35, Assertions: 145, Failures: 1.

[Killed] Division
:102:9
         if ($itemsPerPage <= 0) {
             return 1;
         }
-        return (int)ceil($totalItems / $itemsPerPage);
+        return (int) ceil($totalItems * $itemsPerPage);
     }
 
killedBy: UtilsTest::calculateTotalPages_single_page
statusReason: 1) UtilsTest::calculateTotalPages_single_page
Failed asserting that 50 is identical to 1.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:377

FAILURES!
Tests: 31, Assertions: 133, Failures: 1.

[Killed] RoundingFamily
:102:9
         if ($itemsPerPage <= 0) {
             return 1;
         }
-        return (int)ceil($totalItems / $itemsPerPage);
+        return (int) floor($totalItems / $itemsPerPage);
     }
 
killedBy: UtilsTest::calculateTotalPages_single_page
statusReason: 1) UtilsTest::calculateTotalPages_single_page
Failed asserting that 0 is identical to 1.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:377

FAILURES!
Tests: 31, Assertions: 133, Failures: 1.

[Killed] PublicVisibility
:109:5
      * Truncate text and add ellipsis
      * Used for article previews
      */
-    public static function truncateText(string $text, int $length = 250): string
+    protected static function truncateText(string $text, int $length = 250): string
     {
         $stripped = strip_tags($text);
killedBy: UtilsTest::truncateText_within_limit
statusReason: 1) UtilsTest::truncateText_within_limit
Error: Call to protected method Utils::truncateText() from scope UtilsTest

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:443

ERRORS!
Tests: 37, Assertions: 150, Errors: 1.

[Killed] IncrementInteger
:109:5
      * Truncate text and add ellipsis
      * Used for article previews
      */
-    public static function truncateText(string $text, int $length = 250): string
+    public static function truncateText(string $text, int $length = 251): string
     {
         $stripped = strip_tags($text);
killedBy: UtilsTest::truncateText_default_length
statusReason: 1) UtilsTest::truncateText_default_length
Failed asserting that 254 is equal to 253 or is less than 253.

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:483

FAILURES!
Tests: 40, Assertions: 165, Failures: 1.

[Killed] GreaterThanNegotiation
:112:9
     public static function truncateText(string $text, int $length = 250): string
     {
         $stripped = strip_tags($text);
-        if (strlen($stripped) > $length) {
+        if (strlen($stripped) <= $length) {
             return substr($stripped, 0, $length) . '...';
         }
killedBy: UtilsTest::truncateText_within_limit
statusReason: 1) UtilsTest::truncateText_within_limit
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Short text here'
+'Short text here...'

[Survived] GreaterThan
:112:9
     public static function truncateText(string $text, int $length = 250): string
     {
         $stripped = strip_tags($text);
-        if (strlen($stripped) > $length) {
+        if (strlen($stripped) >= $length) {
             return substr($stripped, 0, $length) . '...';
         }

[Killed] IncrementInteger
:113:13
     {
         $stripped = strip_tags($text);
         if (strlen($stripped) > $length) {
-            return substr($stripped, 0, $length) . '...';
+            return substr($stripped, 1, $length) . '...';
         }
         return $stripped;
killedBy: UtilsTest::truncateText_preserves_content
statusReason: 1) UtilsTest::truncateText_preserves_content
Failed asserting that 'orem ipsum dolo...' starts with "Lorem".

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:495

FAILURES!
Tests: 41, Assertions: 168, Failures: 1.

[Killed] ConcatOperandRemoval
:113:13
     {
         $stripped = strip_tags($text);
         if (strlen($stripped) > $length) {
-            return substr($stripped, 0, $length) . '...';
+            return substr($stripped, 0, $length);
         }
         return $stripped;
killedBy: UtilsTest::truncateText_exceeds_limit
statusReason: 1) UtilsTest::truncateText_exceeds_limit
Failed asserting that 'This is a very long text that should be truncated ' ends with "...".

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:457

FAILURES!
Tests: 38, Assertions: 155, Failures: 1.

[Killed] PublicVisibility
:121:5
     /**
      * Generate comment count badge label
      */
-    public static function getCommentCountLabel(int $count): string
+    protected static function getCommentCountLabel(int $count): string
     {
         return (string)$count;
killedBy: UtilsTest::getCommentCountLabel_returns_string
statusReason: 1) UtilsTest::getCommentCountLabel_returns_string
Error: Call to protected method Utils::getCommentCountLabel() from scope UtilsTest

D:\yosa\app\web-desa-sukasenang-main\web-desa-sukasenang-main\tests\UtilsTest.php:505

ERRORS!
Tests: 42, Assertions: 170, Errors: 1.
